/////////水管类//////////
#include "pipe.h"

Pipe::Pipe()
{
    //记录水管在地图的坐标和长短，0为短管，1为长管
    //短管宽70高100
    //长管宽70高50
    int arr[17][2]={
        {430,1},
        {1800,0},
        {1870,1},
        {1940,0},
        {2010,1},
        {4000,1},
        {4070,1},
        {4210,1},
        {4280,1},
        {5830,1},
        {5970,1},
        {6110,0},
        {6250,0},
        {7300,1},
        {7370,0},
        {7510,1},
        {7580,0}
    };
    QVector<int> v;
    for(int i=0;i<17;++i)
    {
        v.push_back(arr[i][0]+500);
        v.push_back(arr[i][1]);
        mp.push_back(v);
        v.clear();
    }
    heightLong=100;
    heightshort=50;
    widthLong=70;
    widthShort=70;

}
